Revit 2024 API
DividedPath.NumberOfPoints Property
 The total number of points of the divided surface. This combines the layout points and the intersection points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int NumberOfPoints { get; }
Visual Basic
Public ReadOnly Property NumberOfPoints As Integer
	Get
Visual C++
public:
property int NumberOfPoints {
	int get ();
}
See Also
DividedPath Class
Autodesk.Revit.DB Namespace